In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv("C:/Users/ASUS/OneDrive - PESUNIVERSITY/property.csv")
df

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0   104.0      PUTNAM            Y            3        1  1000
1   197.0   LEXINGTON            N            3      1.5    --
2     NaN   LEXINGTON            N          NaN        1   850
3   201.0    BERKELEY           12            1      NaN   700
4   203.0    BERKELEY            Y            3        2  1600
5   207.0    BERKELEY            Y          NaN        1   800
6     NaN  WASHINGTON          NaN            2       --   950
7   213.0     TREMONT            Y           --        1   NaN
8   215.0     TREMONT            Y           na        2  1800

In [3]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [4]:
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [5]:
df['NUM_BEDROOMS']

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: NUM_BEDROOMS, dtype: object

In [6]:
df['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [8]:
missing_values=["na","n/a","-","--"]
df= pd.read_csv("C:/Users/ASUS/OneDrive - PESUNIVERSITY/property.csv",na_values=missing_values)
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1   197.0   LEXINGTON            N           3.0       1.5     NaN
2     NaN   LEXINGTON            N           NaN       1.0   850.0
3   201.0    BERKELEY           12           1.0       NaN   700.0
4   203.0    BERKELEY            Y           3.0       2.0  1600.0
5   207.0    BERKELEY            Y           NaN       1.0   800.0
6     NaN  WASHINGTON          NaN           2.0       NaN   950.0
7   213.0     TREMONT            Y           NaN       1.0     NaN
8   215.0     TREMONT            Y           NaN       2.0  1800.0

In [12]:
missing_values

['na', 'n/a', '-', '--']

In [13]:
df['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
Name: NUM_BEDROOMS, dtype: bool

In [14]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [15]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [16]:
cnt = 0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt,'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt +=1

In [17]:
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1   197.0   LEXINGTON            N           3.0       1.5     NaN
2     NaN   LEXINGTON            N           NaN       1.0   850.0
3   201.0    BERKELEY          NaN           1.0       NaN   700.0
4   203.0    BERKELEY            Y           3.0       2.0  1600.0
5   207.0    BERKELEY            Y           NaN       1.0   800.0
6     NaN  WASHINGTON          NaN           2.0       NaN   950.0
7   213.0     TREMONT            Y           NaN       1.0     NaN
8   215.0     TREMONT            Y           NaN       2.0  1800.0

In [18]:
df.isnull().sum()

ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        2
SQ_FT           2
dtype: int64

In [19]:
df.isnull().values.any()

True

In [20]:
df.isnull().sum().sum()

12

In [26]:
df['ST_NUM'].fillna(125, inplace=True)
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1   197.0   LEXINGTON            N           3.0       1.5     NaN
2   125.0   LEXINGTON            N           NaN       1.0   850.0
3   201.0    BERKELEY          NaN           1.0       NaN   700.0
4   203.0    BERKELEY            Y           3.0       2.0  1600.0
5   207.0    BERKELEY            Y           NaN       1.0   800.0
6   125.0  WASHINGTON          NaN           2.0       NaN   950.0
7   213.0     TREMONT            Y           NaN       1.0     NaN
8   215.0     TREMONT            Y           NaN       2.0  1800.0

In [28]:
df.loc[2,'ST_NUM'] = 125
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1   197.0   LEXINGTON            N           3.0       1.5     NaN
2   125.0   LEXINGTON            N           NaN       1.0   850.0
3   201.0    BERKELEY          NaN           1.0       NaN   700.0
4   203.0    BERKELEY            Y           3.0       2.0  1600.0
5   207.0    BERKELEY            Y           NaN       1.0   800.0
6   125.0  WASHINGTON          NaN           2.0       NaN   950.0
7   213.0     TREMONT            Y           NaN       1.0     NaN
8   215.0     TREMONT            Y           NaN       2.0  1800.0

In [30]:
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median,inplace = True)
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1   197.0   LEXINGTON            N           3.0       1.5     NaN
2   125.0   LEXINGTON            N           3.0       1.0   850.0
3   201.0    BERKELEY          NaN           1.0       NaN   700.0
4   203.0    BERKELEY            Y           3.0       2.0  1600.0
5   207.0    BERKELEY            Y           3.0       1.0   800.0
6   125.0  WASHINGTON          NaN           2.0       NaN   950.0
7   213.0     TREMONT            Y           3.0       1.0     NaN
8   215.0     TREMONT            Y           3.0       2.0  1800.0